app/controllers/groups_controller.rb

SELECT `groups`.* FROM `groups`
---
  def index
    # flash[:notice] = "ohiyo"
    # flash[:alert] = "zzzz"
    @groups = Group.all